src/test/taurus/acceptance_test/acceptance_test1.yml
execution:
- executor: gatling
  concurrency: 1
  ramp-up: 10s
  hold-for: 1s
  iterations: 1
  scenario: scenario-default

# http://gettaurus.org/docs/ScenarioBuilding/
scenarios:
  scenario-default:
    default-address:
    requests:
    - url: /health
      #think-time: 10
      method: GET
      headers:
        Content-Type: application/json
      assert:
      - contains:
        - UP
        subject: body

reporting:
  - module: final-stats
    dump-xml: scenario-default-acceptance-health-stats.xml